import {Injectable} from '@angular/core';
import {HttpClient} from '@angular/common/http';
import {Observable} from 'rxjs';
import {environment} from '../../environments/environment';
import {IAlertData} from "../interfaces/alert-data.interface";

@Injectable({
  providedIn: 'root',
})
export class AlertsFetchService {
  private readonly _historyAlertsUrl: string = environment.HistoryAlertsUrl;

  constructor(private _http: HttpClient) {}

  public fetchRawAlerts(): Observable<any> {
    return this._http.get(this._historyAlertsUrl);
  }

  getMockAlerts(): IAlertData[] {
    return [
      { Date: '2024-12-25 04:22:24', City: 'נווה ירק', Title: 'ירי רקטות וטילים' },
      { Date: '2024-12-25 04:21:51', City: 'בית אלעזרי', Title: 'ירי רקטות וטילים' },
      { Date: '2024-12-25 04:21:26', City: 'גבעת השלושה', Title: 'ירי רקטות וטילים' },
    ];
  }
}


// { Date: '2024-12-25 04:22:24', City: 'נווה ירק', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בית אלעזרי', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בית חלקיה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בני ראם', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'גאליה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'גדרה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'גני טל', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'חפץ חיים', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'יבנה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'יד בנימין', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'כפר הנגיד', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'קדרון', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'רבדים', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'אזור תעשייה כנות', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'אזור תעשייה רבדים', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בית גמליאל', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בן זכאי', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'בניה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'גבעת וושינגטון', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'חצב', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'כנות', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'כפר אביב', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'כפר מרדכי', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'כרם ביבנה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'מישר', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'מפעל אגריגדה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'משגב דב', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'מתחם בני דרום', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'נווה מבטח', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'עשרת', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'קבוצת יבנה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'שדמה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'תחנת רכבת קריית מלאכי - יואב', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'אזור תעשייה גדרה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:51', City: 'מעון צופיה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:32', City: 'גפן', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'תל אביב - מזרח', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'אור יהודה', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'אזור', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'בני ברק', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'בת ים', Title: 'ירי רקטות וטילים' },
// { Date: '2024-12-25 04:21:26', City: 'גבעת השלושה', Title: 'ירי רקטות וטילים' },
// ];
